[
  {
    "id": 3,
    "date": "01.12.2017",
    "subject": "Почти все электромобили Tesla сходят с конвейеров дефектными",
    "message": "Более 90 % электромобилей Tesla Model S и Model X, которые сходят с конвейеров, имеют разного рода дефекты. Об этом сообщает агентство Reuters со ссылкой на бывших и нынешних сотрудников Tesla.\n\nПо их словам, встречаются как мелкие косметические недостатки, вроде вмятин и царапин, так и более крупные — неисправные сидения и двери, нарушение герметичности салона и зазоров кузова. Хотя эти проблемы устраняются перед выставлением машин на продажу, Tesla тратит немало средств на это.\n\nСобеседники информагентства говорят, недоделки проявляются всегда после сборки, однако хронические дефекты в Models S и Model X показывают, что Tesla ещё не освоила даже базовое производство.\n\nСотрудники Tesla, отвечающие за контроль качества продукции, отмечают, что исправлениям подвергаются далеко не все недочёты, при этом в процессе работ выявляются многочисленные новые дефекты, которые не видимы потребителям, но очевидны для отдела контроля качества.\n\nВ Tesla не комментируют информацию о высоком уровне брака сборки, но уверяют, что компания строго следит за производственным процессом.\n\nРанее Tesla неоднократно сообщала о проблемах с производством электрокара Model 3, из-за которых выход новинки отложили. В ноябре 2017 года аналитики заявили, что если в ближайшее время компания не решит эти трудности, то это может привести её к банкротству.",
    "enabled": true
  },
  {
    "id": 2,
    "date": "29.11.2017",
    "subject": "HDMI 2.1: новый стандарт, новый кабель",
    "message": "Накануне организация HDMI Forum утвердила стандарт передачи видеоданных HDMI 2.1, анонсированный ещё в начале года. Помимо трёхкратного увеличения пропускной способности (относительно HDMI 2.0), в финальной версии спецификации интерфейса значится поддержка технологий переменной частоты обновления, динамического HDR и автоматического регулировки латентнтости. Для соединения устройств с нативной поддержкой HDMI 2.1 потребуется новый «ультравысокоскоростной» (Ultra High Speed) кабель.\n\nПеременная частота обновления (англ. Variable Refresh Rate, сокращённо VRR) призвана обеспечить комфортный геймплей. Как и AMD FreeSync, Adaptive-Sync и NVIDIA G-Sync, технология VRR синхронизирует частоту обновления экрана с кадровой частотой, путём чего устраняется подёргивание (micro-stuttering) и другие дефекты изображения, способные отвлечь геймера от игрового процесса.\n\nПод динамическим HDR (Dynamic HDR) подразумевается попеременный вывод необработанного изображения и изображения, обработанного с помощью технологии HDR. Данный подход позволяет получить «идеальную» по всем параметрам картинку на уровне отдельных сцен или даже кадров.",
    "enabled": true
  },
  {
    "id": 1,
    "date": "28.11.2017",
    "subject": "Intel откажется от использования BIOS к 2020 году",
    "message": "BIOS, или базовая система ввода-вывода, до недавнего времени была неотъемлемой частью любого ПК, поскольку была единственной прослойкой программного обеспечения, обеспечивающей нормальное включение и первичную инициализацию устройств компьютера. Система эта далеко не нова — чего стоит один вызов встроенного в ПЗУ языка BASIC в ранних IBM PC при отсутствии загрузочного устройства. Страдает она и рядом других недостатков: использует реальный режим работы x86, инициализирует устройства последовательно, и в целом современные ОС пользуются BIOS только в момент начала загрузки, после чего переходят на использование собственных драйверов и API.\n\nЗаменой BIOS является система UEFI, которая сегодня интегрирована в любую системную плату, от дешёвых экземпляров на базе Atom до мощных многосокетных серверных решений. Она работает очень быстро, поскольку умеет инициализировать устройства параллельно и, к тому же, имеет ряд любопытных возможностей, таких как встроенная отладочная консоль или доступ к файловым системам подключенных накопителей. Очевидно, что осталось старой системе базового ввода-вывода совсем недолго, и корпорация Intel это подтверждает. Простой пример: ни один современный NVMe-накопитель не может работать загрузочным без поддержки со стороны UEFI. Есть способы обхода этого ограничения, но они в любом случае зависят от системы EFI, загружаемой, например, с USB-брелока.\n\nПочему же мы используем BIOS до сих пор? На этот вопрос отвечает представитель Intel Брайан Ричардсон (Brian Richardson). Во-первых, в мире не так уж мало пользователей, которые до сих пор применяют в своей работе программное обеспечение, жёстко зависящее от 16-битной архитектуры BIOS.\n\nВо-вторых, ряд энтузиастов отключает UEFI для отказа от функции secure boot, которая может мешать установке и загрузке нестандартных ОС. Система UEFI официально делится на 4 класса, их функции и возможности демонстрируются на вышеприведённом слайде. Но использование так называемой безопасной загрузки автоматически создаёт пятый класс (он же класс 3+), который не любят практически все — от опытных пользователей до профессионалов, вынужденных работать с нестандартными программными средствами.",
    "enabled": true
  }
]
